# IPython log file

# Mon, 25 Oct 2021 20:58:03
attach('src/suciu_ribbon_knots.sage')
# Mon, 25 Oct 2021 20:58:03
sage.repl.load.load(sage.repl.load.base64.b64decode("c3JjL3N1Y2l1X3JpYmJvbl9rbm90cy5zYWdl"),globals(),True)
# Mon, 25 Oct 2021 20:58:07
k=Integer(2)
# Mon, 25 Oct 2021 20:58:19
Test=G_quotient_by_relation(Integer(2), t_k**Integer(3))
# Mon, 25 Oct 2021 20:58:21
Test
#[Out]# Finitely presented group < t_k, c, d | d^-1*t_k*c*d^-1*t_k*d*c^-1*t_k^-1, c^-1*t_k*c*d^-1*t_k^-1*d*t_k*d*c^-1*t_k^-1, t_k^3 >
# Mon, 25 Oct 2021 20:58:38
Test.order()
#[Out]# 2880
# Mon, 25 Oct 2021 20:58:48
Test.gap().StructureDescription()
#[Out]# "SL(2,5) x SL(2,3)"
# Mon, 25 Oct 2021 21:17:58

Test.gap().IsomorphismSimplifiedFpGroup()
#[Out]# [ t_k, c, d ] -> [ t_k, c, d ]
# Mon, 25 Oct 2021 21:33:16
hom=Test.gap().IsomorphismSimplifiedFpGroup()
# Mon, 25 Oct 2021 21:33:19
hom.Range()
#[Out]# <fp group on the generators [ t_k, c, d ]>
# Mon, 25 Oct 2021 21:33:39
hom.Range().RelatorsOfFpGroup()
#[Out]# [ t_k^3, c^-1*d^-1*t_k*c*d*c^-1*t_k^-1*d, t_k*c*d^-1*t_k^-1*d*c^-1*t_k^-1*d ]
# Mon, 25 Oct 2021 21:33:43
Test
#[Out]# Finitely presented group < t_k, c, d | d^-1*t_k*c*d^-1*t_k*d*c^-1*t_k^-1, c^-1*t_k*c*d^-1*t_k^-1*d*t_k*d*c^-1*t_k^-1, t_k^3 >
# Mon, 25 Oct 2021 21:38:48
perm = Test.gap().IsomorphismPermGroup()
# Mon, 25 Oct 2021 21:38:51
perm
#[Out]# [ t_k, c, d ] -> [ (1,2,3)(4,14,15)(5,18,19)(6,22,23)(7,26,27)(8,30,31)(9,34,35)(10,38,39)(11,42,43)(12,46,47)(13,50,51)(16,62,63)(17,66,67)(20,78,79)(21,82,83)(24,92,93)(28,102,103)(29,106,107)(33,110,76)(36,124,125)(37,128,126)(40,135,136)(41,109,139)(44,147,148)(45,149,150)(48,119,154)(49,158,77)(52,165,166)(53,167,168)(54,86,130)(55,171,140)(56,174,175)(58,179,60)(59,181,144)(61,104,164)(64,192,193)(65,97,157)(68,196,197)(69,195,160)(70,87,198)(71,72,113)(73,115,138)(74,90,203)(75,100,145)(80,208,133)(81,210,211)(84,213,95)(88,220,221)(89,223,200)(91,225,180)(94,151,170)(96,131,188)(98,230,142)(99,132,232)(101,176,237)(105,244,245)(108,153,240)(112,253,212)(114,255,256)(116,204,258)(117,217,261)(118,262,199)(120,263,224)(121,206,236)(122,134,265)(123,146,266)(127,250,156)( [...] ), (1,4,5)(2,6,7)(3,10,11)(8,32,33)(9,36,37)(12,48,49)(13,52,53)(14,54,55)(15,58,59)(16,64,65)(17,68,69)(18,70,71)(19,74,75)(20,80,81)(21,84,85)(22,86,87)(23,89,90)(24,94,66)(25,95,82)(26,96,29)(27,99,100)(28,104,105)(31,110,111)(34,117,118)(35,120,121)(38,130,131)(39,41,132)(40,137,138)(42,140,141)(43,144,145)(45,151,152)(46,153,154)(47,155,156)(50,161,162)(51,122,163)(56,176,119)(57,177,178)(60,183,184)(61,102,185)(62,91,186)(63,189,190)(67,195,149)(72,200,201)(73,202,136)(77,127,101)(78,204,205)(79,206,207)(88,209,222)(92,226,150)(93,196,227)(97,228,229)(98,231,210)(103,238,239)(106,139,246)(107,248,203)(108,237,250)(109,171,251)(112,254,124)(113,169,181)(114,257,214)(115,221,233)(116,259,260)(123,267,268)(125,208,218)(126,182,252)(128,194,142)(129,223,188)( [...] ), (2,8,9)(3,12,13)(4,16,17)(5,20,21)(6,24,25)(7,28,29)(10,40,41)(11,44,45)(14,56,57)(15,60,61)(18,72,73)(19,76,77)(22,54,88)(23,91,46)(26,97,98)(27,101,50)(30,108,109)(31,112,113)(32,114,115)(33,116,38)(34,119,68)(35,122,123)(36,126,127)(37,52,129)(39,133,134)(42,142,143)(43,75,146)(47,149,81)(48,141,157)(49,159,160)(51,164,158)(53,169,170)(55,172,173)(58,180,120)(59,182,82)(62,187,188)(63,78,191)(64,94,137)(65,92,70)(66,153,194)(67,161,171)(69,168,74)(71,199,162)(79,93,204)(80,209,193)(83,105,212)(84,96,214)(85,184,215)(86,216,217)(87,218,219)(89,224,177)(95,139,117)(99,233,234)(100,235,236)(102,189,128)(103,240,241)(104,242,243)(106,247,195)(107,155,249)(110,211,183)(111,252,135)(118,220,228)(121,263,264)(124,269,270)(125,266,271)(130,152,273)(131,274,275)( [...] ) ]
# Mon, 25 Oct 2021 21:39:18

print(perm)
# Mon, 25 Oct 2021 21:39:32

GroupHomomorphismByImages( Group( [ t_k, c, d ] ), Group( [ (  1,  2,  3)(  4, 14, 15)(  5, 18, 19)(  6, 22, 23)(  7, 26, 27)(  8, 30, 31)(  9, 34, 35)( 10, 38, 39)( 11, 42, 43)( 12, 46, 47)( 13, 50, 51)( 16, 62, 63)( 17, 66, 67)( 20, 78, 79)( 21, 82, 83)( 24, 92, 93)( 28,102,103)( 29,106,107)( 33,110, 76)( 36,124,125)( 37,128,126)( 40,135,136)( 41,109,139)( 44,147,148)( 45,149,150)( 48,119,154)( 49,158, 77)( 52,165,166)( 53,167,168)( 54, 86,130)( 55,171,140)( 56,174,175)( 58,179, 60)( 59,181,144)( 61,104,164)( 64,192,193)( 65, 97,157)( 68,196,197)( 69,195,160)( 70, 87,198)( 71, 72,113)( 73,115,138)( 74, 90,203)( 75,100,145)( 80,208,133)( 81,210,211)( 84,213, 95)( 88,220,221)( 89,223,200)( 91,225,180)( 94,151,170)( 96,131,188)( 98,230,142)( 99,132,232)(101,176,237)(105,244,245)(108,153,240)(112,253,212)(114,255,256)(116,204,258)(117,217,261)(118,262,199)(120,263,224)(121,206,236)(122,134,265)(123,146,266)(127,250,156)(129,251,272)(137,222,280)(141,184,283)(143,178,284)(152,293,294)(155,187,264)(159,205,173)(161,273,291)(162,269,297)(163,282,287)(169,248,191)(172,301,235)(177,219,302)(182,305,259)(183,201,246)(185,234,268)(186,229,242)(189,296,304)(190,228,306)(194,281,276)(202,311,275)(207,254,214)(209,278,313)(215,227,226)(216,247,285)(218,309,315)(231,316,289)(233,310,270)(238,312,300)(239,288,267)(241,295,277)(243,257,286)(252,292,299)(260,318,314)(274,317,298)(279,308,320)(303,307,319), 
  (  1,  4,  5)(  2,  6,  7)(  3, 10, 11)(  8, 32, 33)(  9, 36, 37)( 12, 48, 49)( 13, 52, 53)( 14, 54, 55)( 15, 58, 59)( 16, 64, 65)( 17, 68, 69)( 18, 70, 71)( 19, 74, 75)( 20, 80, 81)( 21, 84, 85)( 22, 86, 87)( 23, 89, 90)( 24, 94, 66)( 25, 95, 82)( 26, 96, 29)( 27, 99,100)( 28,104,105)( 31,110,111)( 34,117,118)( 35,120,121)( 38,130,131)( 39, 41,132)( 40,137,138)( 42,140,141)( 43,144,145)( 45,151,152)( 46,153,154)( 47,155,156)( 50,161,162)( 51,122,163)( 56,176,119)( 57,177,178)( 60,183,184)( 61,102,185)( 62, 91,186)( 63,189,190)( 67,195,149)( 72,200,201)( 73,202,136)( 77,127,101)( 78,204,205)( 79,206,207)( 88,209,222)( 92,226,150)( 93,196,227)( 97,228,229)( 98,231,210)(103,238,239)(106,139,246)(107,248,203)(108,237,250)(109,171,251)(112,254,124)(113,169,181)(114,257,214)(115,221,233)(116,259,260)(123,267,268)(125,208,218)(126,182,252)(128,194,142)(129,223,188)(133,276,255)(134,277,168)(135,278,279)(143,219,249)(146,245,288)(147,172,271)(148,290,235)(157,296,285)(158,187,175)(159,224,243)(160,215,293)(164,274,266)(165,241,297)(166,265,291)(167,282,269)(170,197,294)(173,292,199)(174,264,240)(179,198,272)(180,193,304)(191,232,283)(192,216,242)(211,314,286)(212,307,263)(217,253,281)(220,311,313)(225,247,306)(230,258,309)(234,317,300)(236,315,299)(244,312,298)(256,289,319)(261,316,305)(262,303,318)(270,275,308)(273,295,287)(280,310,320), (  2,  8,  9)(  3, 12, 13)(  4, 16, 17)(  5, 20, 21)(  6, 24, 25)(  7, 28, 29)( 10, 40, 41)( 11, 44, 45)( 14, 56, 57)( 15, 60, 61)( 18, 72, 73)( 19, 76, 77)( 22, 54, 88)( 23, 91, 46)( 26, 97, 98)( 27,101, 50)( 30,108,109)( 31,112,113)( 32,114,115)( 33,116, 38)( 34,119, 68)( 35,122,123)( 36,126,127)( 37, 52,129)( 39,133,134)( 42,142,143)( 43, 75,146)( 47,149, 81)( 48,141,157)( 49,159,160)( 51,164,158)( 53,169,170)( 55,172,173)( 58,180,120)( 59,182, 82)( 62,187,188)( 63, 78,191)( 64, 94,137)( 65, 92, 70)( 66,153,194)( 67,161,171)( 69,168, 74)( 71,199,162)( 79, 93,204)( 80,209,193)( 83,105,212)( 84, 96,214)( 85,184,215)( 86,216,217)( 87,218,219)( 89,224,177)( 95,139,117)( 99,233,234)(100,235,236)(102,189,128)(103,240,241)(104,242,243)(106,247,195)(107,155,249)(110,211,183)(111,252,135)(118,220,228)(121,263,264)(124,269,270)(125,266,271)(130,152,273)(131,274,275)(132,225,227)(136,205,166)(138,281,282)(144,285,174)(145,286,287)(147,289,272)(148,276,203)(150,291,278)(151,292,262)(154,295,201)(156,245,186)(163,298,299)(165,300,256)(167,221,196)(175,231,230)(176,268,296)(178,232,303)(179,250,277)(181,238,280)(185,258,213)(190,307,308)(192,309,310)(197,200,301)(198,279,244)(202,306,293)(206,284,222)(207,312,229)(208,294,255)(210,297,288)(223,251,267)(226,253,261)(237,314,257)(239,290,318)(248,313,283)(260,265,320)(302,311,316)(304,305,317) ] ), [ t_k, c, d ], [ (  1,  2,  3)(  4, 14, 15)(  5, 18, 19)(  6, 22, 23)(  7, 26, 27)(  8, 30, 31)(  9, 34, 35)( 10, 38, 39)( 11, 42, 43)( 12, 46, 47)( 13, 50, 51)( 16, 62, 63)( 17, 66, 67)( 20, 78, 79)( 21, 82, 83)( 24, 92, 93)( 28,102,103)( 29,106,107)( 33,110, 76)( 36,124,125)( 37,128,126)( 40,135,136)( 41,109,139)( 44,147,148)( 45,149,150)( 48,119,154)( 49,158, 77)( 52,165,166)( 53,167,168)( 54, 86,130)( 55,171,140)( 56,174,175)( 58,179, 60)( 59,181,144)( 61,104,164)( 64,192,193)( 65, 97,157)( 68,196,197)( 69,195,160)( 70, 87,198)( 71, 72,113)( 73,115,138)( 74, 90,203)( 75,100,145)( 80,208,133)( 81,210,211)( 84,213, 95)( 88,220,221)( 89,223,200)( 91,225,180)( 94,151,170)( 96,131,188)( 98,230,142)( 99,132,232)(101,176,237)(105,244,245)(108,153,240)(112,253,212)(114,255,256)(116,204,258)(117,217,261)(118,262,199)(120,263,224)(121,206,236)(122,134,265)(123,146,266)(127,250,156)(129,251,272)(137,222,280)(141,184,283)(143,178,284)(152,293,294)(155,187,264)(159,205,173)(161,273,291)(162,269,297)(163,282,287)(169,248,191)(172,301,235)(177,219,302)(182,305,259)(183,201,246)(185,234,268)(186,229,242)(189,296,304)(190,228,306)(194,281,276)(202,311,275)(207,254,214)(209,278,313)(215,227,226)(216,247,285)(218,309,315)(231,316,289)(233,310,270)(238,312,300)(239,288,267)(241,295,277)(243,257,286)(252,292,299)(260,318,314)(274,317,298)(279,308,320)(303,307,319), 
  (  1,  4,  5)(  2,  6,  7)(  3, 10, 11)(  8, 32, 33)(  9, 36, 37)( 12, 48, 49)( 13, 52, 53)( 14, 54, 55)( 15, 58, 59)( 16, 64, 65)( 17, 68, 69)( 18, 70, 71)( 19, 74, 75)( 20, 80, 81)( 21, 84, 85)( 22, 86, 87)( 23, 89, 90)( 24, 94, 66)( 25, 95, 82)( 26, 96, 29)( 27, 99,100)( 28,104,105)( 31,110,111)( 34,117,118)( 35,120,121)( 38,130,131)( 39, 41,132)( 40,137,138)( 42,140,141)( 43,144,145)( 45,151,152)( 46,153,154)( 47,155,156)( 50,161,162)( 51,122,163)( 56,176,119)( 57,177,178)( 60,183,184)( 61,102,185)( 62, 91,186)( 63,189,190)( 67,195,149)( 72,200,201)( 73,202,136)( 77,127,101)( 78,204,205)( 79,206,207)( 88,209,222)( 92,226,150)( 93,196,227)( 97,228,229)( 98,231,210)(103,238,239)(106,139,246)(107,248,203)(108,237,250)(109,171,251)(112,254,124)(113,169,181)(114,257,214)(115,221,233)(116,259,260)(123,267,268)(125,208,218)(126,182,252)(128,194,142)(129,223,188)(133,276,255)(134,277,168)(135,278,279)(143,219,249)(146,245,288)(147,172,271)(148,290,235)(157,296,285)(158,187,175)(159,224,243)(160,215,293)(164,274,266)(165,241,297)(166,265,291)(167,282,269)(170,197,294)(173,292,199)(174,264,240)(179,198,272)(180,193,304)(191,232,283)(192,216,242)(211,314,286)(212,307,263)(217,253,281)(220,311,313)(225,247,306)(230,258,309)(234,317,300)(236,315,299)(244,312,298)(256,289,319)(261,316,305)(262,303,318)(270,275,308)(273,295,287)(280,310,320), (  2,  8,  9)(  3, 12, 13)(  4, 16, 17)(  5, 20, 21)(  6, 24, 25)(  7, 28, 29)( 10, 40, 41)( 11, 44, 45)( 14, 56, 57)( 15, 60, 61)( 18, 72, 73)( 19, 76, 77)( 22, 54, 88)( 23, 91, 46)( 26, 97, 98)( 27,101, 50)( 30,108,109)( 31,112,113)( 32,114,115)( 33,116, 38)( 34,119, 68)( 35,122,123)( 36,126,127)( 37, 52,129)( 39,133,134)( 42,142,143)( 43, 75,146)( 47,149, 81)( 48,141,157)( 49,159,160)( 51,164,158)( 53,169,170)( 55,172,173)( 58,180,120)( 59,182, 82)( 62,187,188)( 63, 78,191)( 64, 94,137)( 65, 92, 70)( 66,153,194)( 67,161,171)( 69,168, 74)( 71,199,162)( 79, 93,204)( 80,209,193)( 83,105,212)( 84, 96,214)( 85,184,215)( 86,216,217)( 87,218,219)( 89,224,177)( 95,139,117)( 99,233,234)(100,235,236)(102,189,128)(103,240,241)(104,242,243)(106,247,195)(107,155,249)(110,211,183)(111,252,135)(118,220,228)(121,263,264)(124,269,270)(125,266,271)(130,152,273)(131,274,275)(132,225,227)(136,205,166)(138,281,282)(144,285,174)(145,286,287)(147,289,272)(148,276,203)(150,291,278)(151,292,262)(154,295,201)(156,245,186)(163,298,299)(165,300,256)(167,221,196)(175,231,230)(176,268,296)(178,232,303)(179,250,277)(181,238,280)(185,258,213)(190,307,308)(192,309,310)(197,200,301)(198,279,244)(202,306,293)(206,284,222)(207,312,229)(208,294,255)(210,297,288)(223,251,267)(226,253,261)(237,314,257)(239,290,318)(248,313,283)(260,265,320)(302,311,316)(304,305,317) ] )

perm.Range()
#[Out]# <permutation group of size 2880 with 3 generators>

sage: Exiting Sage (CPU time 13m52.65s, Wall time 18m37.67s). [MPIM metis]



# # # # # # # # # # # # # #
# DIFFERENT RUNS
# # # # # # # # # # # # # #

sage: Test
Finitely presented group < t_k, c, d | d^-1*t_k*c*d^-1*t_k*d*c^-1*t_k^-1, c^-1*t_k*c*d^-1*t_k^-1*d*t_k*d*c^-1*t_k^-1, t_k^3 >
sage: perm=Test.gap().IsomorphismPermGroup()
sage: perm
[ t_k, c, d ] -> [ (1,2,3)(4,12,13)(5,14,15)(6,16,17)(7,20,21)(8,18,22)(9,26,27)(10,23,29)(11,28,30)(25,40,37)(32,35,39)(34,38,36)(41,42,43)(44,51,52)(45,55,56)(46,58,59)(47,61,62)(48,64,65)(49,68,69)(53,72,73)(60,76,67)(63,75,78)(70,71,80)(74,79,77), (1,4,5)(2,6,7)(3,9,10)(8,24,25)(11,32,33)(12,34,21)(13,27,17)(14,23,20)(15,26,36)(16,38,29)(19,39,28)(22,40,31)(41,42,44)(43,47,48)(45,57,56)(46,60,59)(49,68,69)(50,70,71)(51,61,62)(52,64,65)(53,74,58)(63,75,78)(67,79,77)(72,73,76), (2,8,4)(3,11,5)(6,18,19)(7,22,23)(9,28,17)(10,30,31)(12,35,24)(13,26,25)(14,21,32)(15,37,33)(16,34,39)(29,36,40)(42,45,46)(43,49,50)(44,53,54)(47,63,51)(48,66,67)(52,55,68)(56,72,61)(57,74,75)(58,69,60)(59,70,64)(62,77,71)(76,80,78) ]


# # # # # # # # # # # # # #
# Trying out different conjugates of the meridian
# # # # # # # # # # # # # #

sage: Test=G_quotient_by_relation(2, c^3)
sage: Test
Finitely presented group < t_k, c, d | d^-1*t_k*c*d^-1*t_k*d*c^-1*t_k^-1, c^-1*t_k*c*d^-1*t_k^-1*d*t_k*d*c^-1*t_k^-1, c^3 >
sage: Test.order()
2880
sage: perm=Test.gap().IsomorphismPermGroup()
sage: perm
[ t_k, c, d ] -> [ (1,2,3)(5,8,6)(9,10,11)(12,20,21)(13,22,23)(14,24,25)(15,28,29)(16,26,30)(17,34,35)(18,31,37)(19,36,38)(33,48,45)(40,43,47)(42,46,44), (1,2,3)(5,8,6)(9,12,13)(10,14,15)(11,17,18)(16,32,33)(19,40,41)(20,42,29)(21,35,25)(22,31,28)(23,34,44)(24,46,37)(27,47,36)(30,48,39), (2,4,5)(3,6,7)(10,16,12)(11,19,13)(14,26,27)(15,30,31)(17,36,25)(18,38,39)(20,43,32)(21,34,33)(22,29,40)(23,45,41)(24,42,47)(37,44,48) ]

# # # # # # # # # # # # # #
# # # # # # # # # # # # # #

sage: Test=G_quotient_by_relation(2, d^3)
sage: Test
Finitely presented group < t_k, c, d | d^-1*t_k*c*d^-1*t_k*d*c^-1*t_k^-1, c^-1*t_k*c*d^-1*t_k^-1*d*t_k*d*c^-1*t_k^-1, d^3 >
sage: Test.order()
2880
sage: perm=Test.gap().IsomorphismPermGroup()
sage: perm
[ t_k, c, d ] -> [ (1,2,3)(5,8,6)(9,10,11)(12,22,23)(13,26,27)(14,30,31)(15,34,35)(16,38,39)(17,42,43)(18,46,47)(19,50,51)(20,54,55)(21,58,59)(24,69,60)(25,72,73)(28,84,85)(29,88,52)(32,97,98)(36,105,99)(37,107,108)(41,111,82)(44,117,118)(45,121,119)(48,125,126)(49,110,129)(53,134,135)(56,114,137)(57,140,83)(61,145,146)(62,91,122)(63,147,130)(64,128,79)(65,86,67)(66,149,131)(68,106,144)(70,155,156)(71,102,139)(74,158,152)(75,157,141)(76,92,87)(77,78,113)(80,95,150)(81,103,132)(89,163,100)(93,104,148)(94,161,159)(96,115,124)(101,123,154)(109,136,127)(116,133,164)(120,162,138)(142,166,153)(143,168,165)(151,160,167), (1,2,3)(5,8,6)(9,12,13)(10,14,15)(11,18,19)(16,40,41)(17,44,45)(20,56,57)(21,60,61)(22,62,63)(23,65,66)(24,70,71)(25,74,75)(26,76,77)(27,80,81)(28,86,87)(29,89,90)(30,91,92)(31,94,95)(32,99,72)(33,100,88)(34,101,37)(35,42,103)(36,106,53)(39,111,112)(43,47,49)(46,122,123)(48,127,128)(50,130,117)(51,131,132)(54,136,137)(55,125,138)(58,142,102)(59,115,143)(64,148,114)(67,151,118)(68,105,152)(69,96,153)(73,157,134)(78,159,160)(79,140,126)(83,120,104)(84,161,154)(85,110,147)(93,162,109)(97,133,135)(98,158,116)(107,129,167)(108,119,150)(113,121,149)(124,156,146)(139,145,168)(141,164,144)(155,165,166), (2,4,5)(3,6,7)(10,16,17)(11,20,21)(12,24,25)(13,28,29)(14,32,33)(15,36,37)(18,48,49)(19,52,53)(22,64,40)(23,67,68)(26,78,79)(27,82,83)(30,62,93)(31,96,54)(34,102,77)(35,104,58)(38,109,110)(39,50,113)(41,94,46)(42,114,74)(43,115,116)(44,119,120)(45,60,84)(47,65,124)(51,81,133)(55,134,87)(56,117,139)(57,123,141)(59,144,140)(61,121,105)(63,89,101)(66,150,88)(69,126,154)(70,99,127)(71,97,76)(72,136,149)(73,142,147)(75,146,80)(85,98,161)(86,162,156)(90,118,164)(91,165,132)(92,151,111)(100,129,103)(106,166,122)(107,143,157)(108,125,112)(128,131,168)(135,153,138)(137,155,160)(145,148,158)(152,159,163) ]
