# # # # # # # # # # # # # # # # #

sage: attach('src/PSL_2_Z.sage')
sage: k=4
sage: Test=Trefoil_quotient(4)
sage: Test
Finitely presented group < a, b | a^2*b^-3, (a*b^-1*a^-1*b)^4*a*b^-2*a*b*a^-1*(b*a^-1*b^-1*a)^2*(b*a^-1)^2*b^-1*a >
sage: Test(a*b*a^(-1)*b^(-1))==Test(1)

# After running for 188 h on my Samsung laptop, it uses less than 2% of the RAM
# Still running on Samsung laptop

# # # # # # # # # # # # # # # # #

sage: attach('src/suciu_ribbon_knots.sage')
sage: Test=G_quotient_by_relation(4, commutator(d,c))
sage: Test
Finitely presented group < t_k, c, d | d^-1*t_k*(c*d^-1)^3*t_k*(d*c^-1)^3*t_k^-1, c^-1*t_k*c*d^-1*t_k^-1*d*t_k*d*c^-1*t_k^-1, d*c*d^-1*c^-1 >
sage: Test.order()
+Infinity
sage: Test.gap().StructureDescription()
KeyboardInterrupt
# [used up more than 80% of my Samsung laptop RAM]
Exiting Sage (CPU time 851m45.98s, Wall time 847m22.29s).

# Now trying this on MPIM metis

# # # # # # # # # # # # # # # # #

# Finding quotient after finger move relation [c,d]
# with only brown ribbon band attached (this does not depend on k)

sage: attach('src/suciu_ribbon_knots.sage')
sage: F
Free Group on generators {t_k, c, d}
sage: G(3)
Finitely presented group < t_k, c, d | d^-1*t_k*(c*d^-1)^2*t_k*(d*c^-1)^2*t_k^-1, c^-1*t_k*c*d^-1*t_k^-1*d*t_k*d*c^-1*t_k^-1 >
sage: k=3
sage: Test = F / [c^-1*t_k*c*d^-1*t_k^-1*d*t_k*d*c^-1*t_k^-1, commutator(c,d)]
sage: Test
Finitely presented group < t_k, c, d | c^-1*t_k*c*d^-1*t_k^-1*d*t_k*d*c^-1*t_k^-1, c*d*c^-1*d^-1 >
sage: Test.order()
+Infinity
sage: Test.gap().StructureDescription()
KeyboardInterrupt
# [used up more than 75% of my Samsung laptop RAM]
Exiting Sage (CPU time 1952m8.68s, Wall time 1941m28.57s).

# Now trying this on MPIM metis


